zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/atdf/PIC32CK1012GC00064.atdf
          </instance>
        </module>
        <module name="DIB" id="SYSTEM_IP" version="1.0.0">
          <instance name="DIB">
            <register-group name="DIB" name-in-module="DIB" address-space="base" offset="0xE000EFB0"/>
          </instance>
        </module>
        <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1b0">
          <instance name="DMA0">
            <register-group name="DMA0" name-in-module="DMA" address-space="base" offset="0x44802000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="33" caption="Instance index for DMA0"/>
              <param name="MCLK_ID_AHB" value="8" caption="Index for DMA0 AHB clock"/>
              <param name="MCLK_ID_APB" value="65" caption="Index for DMA0 APB clock"/>
              <param name="PAC_ID" value="33" caption="Index for DMA0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="DMA1">
            <register-group name="DMA1" name-in-module="DMA" address-space="base" offset="0x44804000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for DMA1"/>
              <param name="MCLK_ID_AHB" value="9" caption="Index for DMA1 AHB clock"/>
              <param name="MCLK_ID_APB" value="66" caption="Index for DMA1 APB clock"/>
              <param name="PAC_ID" value="34" caption="Index for DMA1 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="04850" name2="icd_dsu_u2810_v3" version="3a0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x44000000"/>
            <parameters>
              <param name="BMX_ERROR_SUPPORT" value="0" caption="Defines whether DSU APB errors are reported as 2-cycles bus errors to the AHB AP0 master"/>
              <param name="DAL1_IMPLEMENTED" value="1" caption="Debug Access Level 1 (Non-Secure) Implemented? for TZ devices only"/>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for DSU"/>
              <param name="MCLK_ID_AHB" value="3" caption="Index for DSU AHB clock"/>
              <param name="MCLK_ID_APB" value="32" caption="Index for DSU APB clock"/>
              <param name="PAC_ID" value="0" caption="Index for DSU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
            <parameters>
              <param name="__WPT_NUM" value="4" caption="Number of DWT watchpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x4401A000"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PC00"/>
              <signal group="EXTINT" index="0" function="A" pad="PD00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PC01"/>
              <signal group="EXTINT" index="1" function="A" pad="PD01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="2" function="A" pad="PC02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="3" function="A" pad="PC03"/>
              <signal group="EXTINT" index="3" function="A" pad="PD03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="4" function="A" pad="PC04"/>
              <signal group="EXTINT" index="4" function="A" pad="PD04"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="5" function="A" pad="PC05"/>
              <signal group="EXTINT" index="5" function="A" pad="PD05"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PC06"/>
              <signal group="EXTINT" index="6" function="A" pad="PD06"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PC07"/>
              <signal group="EXTINT" index="7" function="A" pad="PD07"/>
              <signal group="EXTINT" index="8" function="A" pad="PA08"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PD08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="9" function="A" pad="PC09"/>
              <signal group="EXTINT" index="9" function="A" pad="PD09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="10" function="A" pad="PC10"/>
              <signal group="EXTINT" index="10" function="A" pad="PD10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC11"/>
              <signal group="EXTINT" index="11" function="A" pad="PD11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC12"/>
              <signal group="EXTINT" index="13" function="A" pad="PC13"/>
              <signal group="EXTINT" index="14" function="A" pad="PA00"/>
              <signal group="NMI" function="A" pad="PD02"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="5" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="13" caption="Instance index for EIC"/>
              <param name="MCLK_ID_APB" value="45" caption="Index for EIC APB clock"/>
              <param name="PAC_ID" value="13" caption="Index for EIC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x4480E000"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="32" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="5" caption="Number of bits to select Channel"/>
              <param name="GCLK_ID_0" value="6" caption="Index of Generic Clocks for Synchronous Channels 0"/>
              <param name="GCLK_ID_1" value="7" caption="Index of Generic Clocks for Synchronous Channels 1"/>
              <param name="GCLK_ID_2" value="8" caption="Index of Generic Clocks for Synchronous Channels 2"/>
              <param name="GCLK_ID_3" value="9" caption="Index of Generic Clocks for Synchronous Channels 3"/>
              <param name="GCLK_ID_4" value="10" caption="Index of Generic Clocks for Synchronous Channels 4"/>
              <param name="GCLK_ID_5" value="11" caption="Index of Generic Clocks for Synchronous Channels 5"/>
              <param name="GCLK_ID_6" value="12" caption="Index of Generic Clocks for Synchronous Channels 6"/>
              <param name="GCLK_ID_7" value="13" caption="Index of Generic Clocks for Synchronous Channels 7"/>
              <param name="GCLK_ID_8" value="14" caption="Index of Generic Clocks for Synchronous Channels 8"/>
              <param name="GCLK_ID_9" value="15" caption="Index of Generic Clocks for Synchronous Channels 9"/>
              <param name="GCLK_ID_10" value="16" caption="Index of Generic Clocks for Synchronous Channels 10"/>
              <param name="GCLK_ID_11" value="17" caption="Index of Generic Clocks for Synchronous Channels 11"/>
              <param name="GENERATORS" value="125" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="SPLIT_IRQ_NUM" value="4" caption="Number of channels with dedicated interrupt line request"/>
              <param name="SYNCH_NUM" value="12" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="4" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="104" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="7" caption="Number of bits to select Event User"/>
              <param name="USERS_GROUPS" value="4" caption="Number of 32-user Groups"/>
              <param name="INSTANCE_ID" value="39" caption="Instance index for EVSYS"/>
              <param name="MCLK_ID_APB" value="70" caption="Index for EVSYS APB clock"/>
              <param name="PAC_ID" value="39" caption="Index for EVSYS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCR" id="03438" name2="pfm_ctrlr_apb_v1" version="1b0">
          <instance name="FCR">
            <register-group name="FCR" name-in-module="FCR" address-space="base" offset="0x44002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="1" caption="Instance index for FCR"/>
              <param name="MCLK_ID_AHB" value="4" caption="Index for FCR AHB clock"/>
              <param name="MCLK_ID_APB" value="33" caption="Index for FCR APB clock"/>
              <param name="PAC_ID" value="1" caption="Index for FCR registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCW" id="03433" name2="pfm_ctrlw_apb_v1" version="1b0">
          <instance name="FCW">
            <register-group name="FCW" name-in-module="FCW" address-space="base" offset="0x44004000"/>
            <parameters>
              <param name="PFM_NUM_PAGES" value="128" caption="No of PFM Pages Per panel"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="Flash Page Size MSB"/>
              <param name="PFM_PAGE_SIZE" value="4096" caption="PFM page size"/>
              <param name="PFM_PNL_ADDR_MSB" value="18" caption="Single flash panel read address MSbit (using byte addressing)"/>
              <param name="PFM_SIZE" value="3" caption="Flash Memory Parameters"/>
              <param name="PFM_SYS_ADDR_MSB" value="19" caption="The MS bit of the system byte address needed to address the entire PFM region (both panels Main)"/>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGES" value="256"/>
              <param name="PAGES_PR_REGION" value="16"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for FCW"/>
              <param name="MCLK_ID_AHB" value="5" caption="Index for FCW AHB clock"/>
              <param name="MCLK_ID_APB" value="34" caption="Index for FCW APB clock"/>
              <param name="PAC_ID" value="2" caption="Index for FCW registers write protection"/>
            </parameters>
          </instance>
        </module>
