zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/atdf/PIC32CK1012GC00064.atdf
        <register name="SYNCBUSY" offset="0xE8" rw="R" size="4" initval="0x00000000" caption="CORE SYNC Busy Status Register">
          <bitfield name="SWRST" caption="Software Reset Sync Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable bit Sync Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB sync busy" mask="0x4"/>
        </register>
        <register name="DMAINTENCLR" offset="0xF0" rw="RW" size="4" atomic-op="clear:DMAINTENCLR" initval="0x00000000" caption="DMA Interrupt Enable Clear">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF"/>
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0"/>
          <bitfield name="SOVFL" caption="Synchonizer Overflow" mask="0x10000"/>
        </register>
        <register name="DMAINTSET" offset="0xF4" rw="RW" size="4" atomic-op="set:DMAINTSET" initval="0x00000000" caption="DMA Interrupt Enable Set">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF"/>
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0"/>
          <bitfield name="SOVFL" caption="Synchonizer Overflow" mask="0x10000"/>
        </register>
        <register name="DMAINTFLAG" offset="0xF8" rw="RW" size="4" atomic-op="clear:DMAINTFLAG" initval="0x00000000" caption="DMA Interrupt Flag and Status">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF"/>
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0"/>
          <bitfield name="EAF" caption="Ram Buffer A Overflow Error" mask="0xF00"/>
          <bitfield name="EBF" caption="Ram Buffer B Overflow Error" mask="0xF000"/>
          <bitfield name="SOVFL" caption="Synchronizer overflow" mask="0x10000"/>
          <bitfield name="DMAERR" caption="DMA Bus Error" mask="0x20000"/>
        </register>
        <register name="CTLINTENSET" offset="0xFC" rw="RW" size="4" atomic-op="set:CTLINTENSET" initval="0x00000000" caption="CORE Controller Interrupt Enable Set">
          <bitfield name="CRRDY" caption="Core Ready" mask="0xF"/>
          <bitfield name="VREFUPD" caption="VREF update" mask="0x40"/>
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80"/>
          <bitfield name="PFFUNF" caption="APB FIFO Underflow" mask="0x100"/>
          <bitfield name="PFFOVF" caption="APB FIFO Overflow" mask="0x200"/>
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400"/>
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800"/>
        </register>
        <register name="CTLINTENCLR" offset="0x100" rw="RW" size="4" atomic-op="clear:CTLINTENCLR" initval="0x00000000" caption="CORE Controller Interrupt Enable Clear">
          <bitfield name="CRRDY" caption="Core Ready Disable" mask="0xF"/>
          <bitfield name="VREFUPD" caption="VREF Update" mask="0x40"/>
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80"/>
          <bitfield name="PFFUNF" caption="APB FIFO underflow" mask="0x100"/>
          <bitfield name="PFFOVF" caption="APB FIFO overflow" mask="0x200"/>
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400"/>
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800"/>
        </register>
        <register name="CTLINTFLAG" offset="0x104" rw="RW" size="4" atomic-op="clear:CTLINTFLAG" initval="0x00000000" caption="CORE Controller Interrupt Flags">
          <bitfield name="CRRDY" caption="Core Ready" mask="0xF"/>
          <bitfield name="VREFUPD" caption="VREF update" mask="0x40"/>
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80"/>
          <bitfield name="PFFUNF" caption="APB FIFO underflow" mask="0x100"/>
          <bitfield name="PFFOVF" caption="APB FIFO overflow" mask="0x200"/>
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400"/>
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800"/>
        </register>
        <register-group name="INT" name-in-module="INT" offset="0x120" size="0x10" count="1"/>
        <register name="DBGCTRL" offset="0x168" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Running State" mask="0x1"/>
        </register>
      </register-group>
      <value-group caption="ADC Resolution bits" name="CORCTRL__SELRES">
        <value name="6_BITS" caption="6 bits" value="0x0"/>
        <value name="8_BITS" caption="8 bits" value="0x1"/>
        <value name="10_BITS" caption="10 bits" value="0x2"/>
        <value name="12_BITS" caption="12 bits (default)" value="0x3"/>
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="FLTCTRL__OVRSAM">
        <value name="4_SAMPLES" caption="(If FMODE is 0) 4 samples (shift sum 1 bit to right, output data is 13-bits) / (If FMODE is 1) 2 samples to be averaged" value="0x0"/>
        <value name="16_SAMPLES" caption="(If FMODE is 0) 16 samples (shift sum 2 bits to right, output data is 14-bits) / (If FMODE is 1) 4 samples to be averaged" value="0x1"/>
        <value name="64_SAMPLES" caption="(If FMODE is 0) 64 samples (shift sum 3 bits to right, output data is 15-bits) / (If FMODE is 1) 8 samples to be averaged" value="0x2"/>
        <value name="256_SAMPLES" caption="(If FMODE is 0) 256 samples (shift sum 4 bits to right, output data is 16-bits) / (If FMODE is 1) 16 samples to be averaged" value="0x3"/>
        <value name="2_SAMPLES" caption="(If FMODE is 0) 2 samples (shift sum 0 bits to right, output data is 12.1 format) / (If FMODE is 1) 32 samples to be averaged" value="0x4"/>
        <value name="8_SAMPLES" caption="(If FMODE is 0) 8 samples (shift sum 1 bit to right, output data is 13.1 format) / (If FMODE is 1) 64 samples to be averaged" value="0x5"/>
        <value name="32_SAMPLES" caption="(If FMODE is 0) 32 samples (shift sum 2 bits to right, output data is 14.1 format) / (If FMODE is 1) 128 samples to be averaged" value="0x6"/>
        <value name="128_SAMPLES" caption="(If FMODE is 0) 128 samples (shift sum 3 bits to right, output data is 15.1 format) / (If FMODE is 1) 256 samples to be averaged" value="0x7"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion" name="CHNCFG4_CHNCFG5__TRGSRC">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0x0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="0x1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="0x2"/>
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="0x3"/>
        <value name="SYNC_TRIGGER" caption="STRIG Synchronous Trigger" value="0x4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="0x5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="0x6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="0x7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="0x8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="0x9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="0xA"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="0xB"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="0xC"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="0xD"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="0xE"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="0xF"/>
      </value-group>
      <value-group caption="SCAN Trigger Source Selection" name="CORCTRL__STRGSRC">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0x0"/>
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="0x1"/>
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="0x2"/>
        <value name="SYNC_TRIGGER" caption="STRIG Synchronous Trigger" value="0x4"/>
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="0x5"/>
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="0x6"/>
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="0x7"/>
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="0x8"/>
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="0x9"/>
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="0xA"/>
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="0xB"/>
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="0xC"/>
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="0xD"/>
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="0xE"/>
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="0xF"/>
      </value-group>
      <value-group caption="Voltage Reference Input Selection bits" name="CTRLD__VREFSEL">
        <value name="AVDD_AVSS" caption="AVDD and AVSS" value="0x0"/>
        <value name="EXTERNAL_VREFH_AVSS" caption="External VREFH and AVSS" value="0x1"/>
      </value-group>
      <value-group caption="ADC DMA PFFRDY Trigger Selection bits" name="PFFCTRL__PFFRDYDMA">
        <value name="CTLINTFLAG_PFFHFUL" caption="Selects CTLINTFLAG.PFFHFUL for the ADC DMA PFFRDY trigger signal to the DMAC" value="0x0"/>
        <value name="CTLINTFLAG_PFFRDY" caption="Selects CTLINTFLAG.PFFRDY for the ADC DMA PFFRDY trigger signal to the DMAC" value="0x1"/>
      </value-group>
    </module>
   <module name="BSDAP" id="04990" name2="jtag_bs_dap_sib_v2" version="2a0" caption="Boundary Scan DAP System Integration Block"/>
    <module name="CCL" id="03718" name2="cla_ccl_u2225_v2" version="2b0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
