zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc00/atdf/PIC32CK1012GC00064.atdf
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="ITM Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="ITM Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="ITM Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="ITM Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000001" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CLKDIV" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Clock Divider Control">
          <bitfield name="DIV" caption="Clock Domain Division Factor" mask="0xFF" values="CLKDIV__DIV"/>
        </register>
        <register name="CLKMSK" offset="0x3C" rw="RW" size="4" count="9" initval="0x00000000" caption="Peripheral Clock Enable Mask">
          <bitfield name="MASK" caption="Peripheral Clock Enable Mask" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CLKDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MCRAMC" id="04921" name2="drm_mcramc_v5" version="5b0" caption="Multi-Channel RAM Controller">
      <register-group name="MCRAMC" caption="Multi-Channel RAM Controller">
        <register name="MCRAMC_CTRLA" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000002" caption="Control Enable A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="MCRAMC_CTRLA__SWRST"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable" mask="0x2" values="MCRAMC_CTRLA__ENABLE"/>
        </register>
        <register name="MCRAMC_INTENCLR" offset="0x8" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Clear" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Clear" mask="0x2"/>
        </register>
        <register name="MCRAMC_INTENSET" offset="0xC" rw="RW" size="4" access-size="4" atomic-op="set:MCRAMC_INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Set" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Set" mask="0x2"/>
        </register>
        <register name="MCRAMC_INTSTA" offset="0x10" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTSTA" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="SERR" caption="Single Bit Error" mask="0x1"/>
          <bitfield name="DERR" caption="Double Bit Error" mask="0x2"/>
        </register>
